Revit 2026 API

# UVSubtract Method

---

Subtracts the specified 2-D vector from this 2-D vector and returns the result.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public UV Subtract(
	UV source
)
```
```vb
Public Function Subtract (
	source As UV
) As UV
```
```cpp
public:
UV^ Subtract(
	UV^ source
)
```
```fsharp
member Subtract :
        source : UV -> UV
```

#### Parameters

source UV
    The vector to subtract from this vector.

#### Return Value

UVThe 2-D vector equal to the difference between the two vectors.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when left is . |

The subtracted vector is obtained by subtracting each coordinate of the specified vector from the corresponding coordinate of this vector.

#### Reference

UV Class

Autodesk.Revit.DB Namespace